#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bervproject/aws-personal-iac/runs/run-5tVspb9bCVbHRjVn

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_ecr_repository.demo_ecr: Refreshing state... [id=demo_ecr]
aws_dynamodb_table.ap-southeast-1: Refreshing state... [id=note]
aws_dynamodb_global_table.note: Refreshing state... [id=note]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ecr_repository.demo_ecr has been deleted
  - resource "aws_ecr_repository" "demo_ecr" {
      - arn                  = "arn:aws:ecr:ap-southeast-1:092318301320:repository/demo_ecr" -> null
      - id                   = "demo_ecr" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "demo_ecr" -> null
      - registry_id          = "092318301320" -> null
      - repository_url       = "092318301320.dkr.ecr.ap-southeast-1.amazonaws.com/demo_ecr" -> null
      - tags                 = {
          - "Environment" = "dev"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.demo_ecr will be created
  + resource "aws_ecr_repository" "demo_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "demo_ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
        }
      + tags_all             = {
          + "Environment" = "dev"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @berviantoleo, Action: `pull_request`*